ХМНПФ_Общее/Documents/уп_ОтказыПФР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ОтказыПФР</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорыОПС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоговорОПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отказ1</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отказ2</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отказ3</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отказ4</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отказ5</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отказ6</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отказ7</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отказ8</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отказ9</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отказ10</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отказ11</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отказ12</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отказ15</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ХМ_Отказ15</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_СостоянияДоговораОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостоянияДоговораОПС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_СостоянияДоговоровОПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУстановкиСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_СостоянияДоговоровОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостоянияДоговоровОПС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Заключен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжиданиеПодтвержденияПФР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжиданиеПоступленияВзносов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НакопительныйПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатнойПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПриостановленПоОтказуИзПФР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодготовкаКЗакрытию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатыПриостановлены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачисленияПриостановлены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиновременнаяВыплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбязательстваВыполнены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_Анулирован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Documents/уп_ОтказыПФР/Forms/ФормаДокумента/Ext/Form/Module.bsl
// ХМНПФ 30.05.2018 КлименкоМИ // Новая ХМ_УстановитьДействияФормы() // №1646
&НаСервере
Процедура ХМ_УстановитьДействияФормы()
	Элт = Элементы.Добавить("ХМ_ДоговорыОПСОтказ15", Тип("ПолеФормы"), Элементы.ДоговорыОПС);
	Элт.Вид = ВидПоляФормы.ПолеФлажка;
	Элт.ПутьКДанным = "Объект.ДоговорыОПС.ХМ_Отказ15"; 
	
	ЭлементНадпись = Элементы.Добавить("ХМ_Декорация43", Тип("ДекорацияФормы"), Элементы.Отказы2016);
	ЭлементНадпись.Заголовок = "15 - Срок рассмотрения заявления не наступил";	
	ЭлементНадпись.Вид = ВидДекорацииФормы.Надпись;
КонецПроцедуры

Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 28.03.2017 ШадринАВ // РазобратьТаблицу() // №891
	// ХМНПФ 28.03.2017 ШадринАВ // ОткрытьФайл() // №891
	// ХМНПФ 19.03.2018 КлименкоМИ // РазобратьТаблицу() // №1435
	// ХМНПФ 30.05.2018 КлименкоМИ // ПриСозданииНаСервере() // №1646
	// ХМНПФ 30.05.2018 КлименкоМИ // Новая ХМ_УстановитьДействияФормы() // №1646
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура ХМПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Объект.Ссылка.Пустая() Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
			Объект.Организация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
		КонецЕсли;
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		Объект.Дата = ТекущаяДата();
	КонецЕсли;

	УстановитьВидимость();

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	#Вставка		
	//+ ХМНПФ 30.05.2018 КлименкоМИ // ПриСозданииНаСервере() // №1646
	ХМ_УстановитьДействияФормы();
	//- ХМНПФ 30.05.2018 КлименкоМИ // ПриСозданииНаСервере() // №1646
    #КонецВставки
	
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ОткрытьФайл")
Процедура ХМОткрытьФайл(Хранение, Протокол)

	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("СНИЛС", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(14)));
	ТЗ.Колонки.Добавить("Нпп", Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(6,0)));
	ТЗ.Колонки.Добавить("Фамилия", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(50)));
	ТЗ.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(50)));
	ТЗ.Колонки.Добавить("Отчество", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(50)));
	ТЗ.Колонки.Добавить("ДатаРождения", Новый ОписаниеТипов("Дата"));
	ТЗ.Колонки.Добавить("НомерДоговора", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(25)));
	ТЗ.Колонки.Добавить("ДатаЗаключения", Новый ОписаниеТипов("Дата"));
	ТЗ.Колонки.Добавить("Ошб1", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(1)));
	ТЗ.Колонки.Добавить("Ошб2", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(1)));
	ТЗ.Колонки.Добавить("Ошб3", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(1)));
	ТЗ.Колонки.Добавить("Ошб4", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(1)));
	ТЗ.Колонки.Добавить("Ошб5", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(1)));
	ТЗ.Колонки.Добавить("Ошб6", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(1)));
	ТЗ.Колонки.Добавить("Ошб7", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(1)));
	ТЗ.Колонки.Добавить("Ошб8", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(1)));
	ТЗ.Колонки.Добавить("Ошб9", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(1)));
	ТЗ.Колонки.Добавить("Ошб10", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(1)));
	ТЗ.Колонки.Добавить("Ошб11", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(1)));
	ТЗ.Колонки.Добавить("Ошб12", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(1)));

	Root = уп_ОПС.CreateDOMDocument();

	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(Хранение);
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	РабФайл = Новый Файл(ИмяВременногоФайла);

	Root.Load(РабФайл.ПолноеИмя);

	ВыбранНужный = Ложь;

	//старый вариант
	Nodes = Root.getElementsByTagName("ЗЛ");
	Всего = Nodes.length;

	Если Всего>0 Тогда
		ВыбранНужный = Истина;
		для Н = 1 по Всего цикл 

			//Состояние("Загрузка строки "+Н+" из "+Всего);

			Node = Nodes.item(Н-1);
			NodeFIO = Node.getElementsByTagName("ФИО").item(0); 

			Стр = ТЗ.Добавить();

			Стр.СНИЛС = уп_ОПС.ЗначениеУникальногоКлюча(Node,"СНИЛС");
			Стр.Нпп = уп_ОПС.ЗначениеУникальногоКлюча(Node,"Нпп");
			Стр.Фамилия = уп_ОПС.ЗначениеУникальногоКлюча(NodeFIO,"Фамилия");
			Стр.Имя = уп_ОПС.ЗначениеУникальногоКлюча(NodeFIO,"Имя");
			Стр.Отчество = уп_ОПС.ЗначениеУникальногоКлюча(NodeFIO,"Отчество");
			ДатаРожд = уп_ОПС.ЗначениеУникальногоКлюча(Node,"ДатаРождения");
			Если ЗначениеЗаполнено(ДатаРожд) Тогда
				Стр.ДатаРождения = Дата(Прав(СокрЛП(ДатаРожд),4),Сред(СокрЛП(ДатаРожд),4,2), Лев(СокрЛП(ДатаРожд),2),00,00,00);
			КонецЕсли;
			Стр.Ошб1 = уп_ОПС.ЗначениеУникальногоКлюча(Node,"Ошб1");
			Стр.Ошб2 = уп_ОПС.ЗначениеУникальногоКлюча(Node,"Ошб2");
			Стр.Ошб3 = уп_ОПС.ЗначениеУникальногоКлюча(Node,"Ошб3");
			Стр.Ошб4 = уп_ОПС.ЗначениеУникальногоКлюча(Node,"Ошб4");
			Стр.Ошб5 = уп_ОПС.ЗначениеУникальногоКлюча(Node,"Ошб5");
			Стр.Ошб6 = уп_ОПС.ЗначениеУникальногоКлюча(Node,"Ошб6");

		конеццикла;
		ТипТаблицы = 2;
	КонецЕсли;

	//СНП 
	Если НЕ ВыбранНужный Тогда
		Nodes = Root.getElementsByTagName("СведенияОЗЛиДоговоре");
		Всего = Nodes.length;

		Если Всего>0 Тогда
			ВыбранНужный = Истина;
			для Н = 1 по Всего цикл 

				//Состояние("Загрузка строки "+Н+" из "+Всего);

				Node = Nodes.item(Н-1);
				NodeFIO = Node.getElementsByTagName("ФИО").item(0); 
				NodeDOG = Node.getElementsByTagName("Договор").item(0);
				NodeNPO = Node.getElementsByTagName("НомерПричиныОтказа");
				ВсегоПричин = NodeNPO.length;

				Стр = ТЗ.Добавить();

				//Стр.СНИЛС = уп_ОПС.ЗначениеУникальногоКлюча(Node,"СНИЛС");
				СНИЛС1 = уп_ОПС.ЗначениеУникальногоКлюча(Node,"СтраховойНомер");
				Если СтрДлина(СНИЛС1)<9 Тогда
					СНИЛС1 = ДобавитьДоФормата(СНИЛС1,9,"0","Лево");
				КонецЕсли;
				СНИЛС2 =  уп_ОПС.ЗначениеУникальногоКлюча(Node,"КонтрольноеЧисло");
				Если СтрДлина(СНИЛС2)<2 Тогда
					СНИЛС2 = ДобавитьДоФормата(СНИЛС2,2,"0","Лево");
				КонецЕсли;
				СНИЛС = Лев(СНИЛС1,3)+"-"+Сред(СНИЛС1,4,3)+"-"+Прав(СНИЛС1,3)+" "+СНИЛС2;
				Стр.СНИЛС = СНИЛС;
				//Стр.Нпп = уп_ОПС.ЗначениеУникальногоКлюча(Node,"НомерПП");
				Стр.Нпп = уп_ОПС.ЗначениеУникальногоКлюча(Node,"НомерПоТому");
				Стр.Фамилия = уп_ОПС.ЗначениеУникальногоКлюча(NodeFIO,"Фамилия");
				Стр.Имя = уп_ОПС.ЗначениеУникальногоКлюча(NodeFIO,"Имя");
				Стр.Отчество = уп_ОПС.ЗначениеУникальногоКлюча(NodeFIO,"Отчество");
				Стр.НомерДоговора = уп_ОПС.ЗначениеУникальногоКлюча(NodeDOG,"Номер");
				ДатаЗакл = уп_ОПС.ЗначениеУникальногоКлюча(NodeDOG,"ДатаЗаключения");
				Стр.ДатаЗаключения = Дата(Прав(СокрЛП(ДатаЗакл),4),Сред(СокрЛП(ДатаЗакл),4,2), Лев(СокрЛП(ДатаЗакл),2),00,00,00);
				Для К = 1 по ВсегоПричин Цикл
					НомерОшибки = NodeNPO.item(К-1).nodeTypedValue;
					Если НомерОшибки = "1" Тогда
						Стр.Ошб1 = "V";
					ИначеЕсли НомерОшибки = "2" Тогда
						Стр.Ошб2 = "V";
					ИначеЕсли НомерОшибки = "3" Тогда
						Стр.Ошб3 = "V";
					ИначеЕсли НомерОшибки = "4" Тогда
						Стр.Ошб4 = "V";
					ИначеЕсли НомерОшибки = "5" Тогда
						Стр.Ошб5 = "V";
					ИначеЕсли НомерОшибки = "6" Тогда
						Стр.Ошб6 = "V";
					ИначеЕсли НомерОшибки = "7" Тогда
						Стр.Ошб7 = "V";
					ИначеЕсли НомерОшибки = "8" Тогда
						Стр.Ошб8 = "V";
					ИначеЕсли НомерОшибки = "9" Тогда
						Стр.Ошб9 = "V";
					ИначеЕсли НомерОшибки = "10" Тогда
						Стр.Ошб10 = "V";
					ИначеЕсли НомерОшибки = "11" Тогда
						Стр.Ошб11 = "V";
					ИначеЕсли НомерОшибки = "12" Тогда
						Стр.Ошб12 = "V";
					#Вставка 
					// +ХМНПФ 28.03.2017 ШадринАВ // ОткрытьФайл() // №891
					ИначеЕсли НомерОшибки = "13" Тогда
						Стр.Ошб9 = "V";
					// -ХМНПФ 28.03.2017 ШадринАВ // ОткрытьФайл() // №891						
					#КонецВставки
					Иначе
						Сообщить("Для номера "+Стр.Нпп+" причина отказа не идентифицирована.");
					КонецЕсли;	
				КонецЦикла;	
			конеццикла;
			ТипТаблицы = 1;
		КонецЕсли;
	КонецЕсли;	

	РазобратьТаблицу(ТЗ,ТипТаблицы, Протокол);

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("РазобратьТаблицу")
Процедура ХМРазобратьТаблицу(ТЗ, ТипТаблицы, Протокол)

	Если ТипТаблицы = 1 Тогда //есть номер и дата договора

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТабДляЗагрузки.СНИЛС,
		|	ТабДляЗагрузки.НомерДоговора,
		|	ТабДляЗагрузки.ДатаЗаключения,
		|	ТабДляЗагрузки.Фамилия,
		|	ТабДляЗагрузки.Имя,
		|	ТабДляЗагрузки.Отчество,
		|	ТабДляЗагрузки.Ошб1,
		|	ТабДляЗагрузки.Ошб2,
		|	ТабДляЗагрузки.Ошб3,
		|	ТабДляЗагрузки.Ошб4,
		|	ТабДляЗагрузки.Ошб5,
		|	ТабДляЗагрузки.Ошб6,
		|	ТабДляЗагрузки.Ошб7,
		|	ТабДляЗагрузки.Ошб8,
		|	ТабДляЗагрузки.Ошб9,
		|	ТабДляЗагрузки.Ошб10,
		|	ТабДляЗагрузки.Ошб11,
		|	ТабДляЗагрузки.Ошб12,
		|	ТабДляЗагрузки.Нпп
		|ПОМЕСТИТЬ ИсходныеДанные
		|ИЗ
		|	&ТабДляЗагрузки КАК ТабДляЗагрузки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсходныеДанные.СНИЛС,
		|	ИсходныеДанные.НомерДоговора,
		|	ИсходныеДанные.ДатаЗаключения,
		|	ИсходныеДанные.Фамилия,
		|	ИсходныеДанные.Имя,
		|	ИсходныеДанные.Отчество,
		|	ИсходныеДанные.Ошб1,
		|	ИсходныеДанные.Ошб2,
		|	ИсходныеДанные.Ошб3,
		|	ИсходныеДанные.Ошб4,
		|	ИсходныеДанные.Ошб5,
		|	ИсходныеДанные.Ошб6,
		|	ИсходныеДанные.Ошб7,
		|	ИсходныеДанные.Ошб8,
		|	ИсходныеДанные.Ошб9,
		|	ИсходныеДанные.Ошб10,
		|	ИсходныеДанные.Ошб11,
		|	ИсходныеДанные.Ошб12,
		|	уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС,
		|	Контрагенты.Ссылка КАК ЗЛ,
		|	уп_СостоянияДоговораОПССрезПоследних.Состояние,
		|	ИсходныеДанные.Нпп КАК Нпп
		|ИЗ
		|	ИсходныеДанные КАК ИсходныеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_СостоянияДоговораОПС.СрезПоследних(&ДатаДок, ДоговорОПС.Организация = &Организация) КАК уп_СостоянияДоговораОПССрезПоследних
		|		ПО ИсходныеДанные.СНИЛС = уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР
		|			И ИсходныеДанные.НомерДоговора = уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС.Код
		#Удаление 
		|			И (НАЧАЛОПЕРИОДА(ИсходныеДанные.ДатаЗаключения, ДЕНЬ) = НАЧАЛОПЕРИОДА(уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС.ДатаЗаключения, ДЕНЬ))
		#КонецУдаления 
		#Вставка 
		// +ХМНПФ 28.03.2017 ШадринАВ // РазобратьТаблицу() // №891
		#КонецВставки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|		ПО ИсходныеДанные.СНИЛС = Контрагенты.уп_ФизЛицо.СтраховойНомерПФР
		|
		|УПОРЯДОЧИТЬ ПО
		|	Нпп";

		Запрос.УстановитьПараметр("ДатаДок", Объект.Дата);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("ТабДляЗагрузки", ТЗ);

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.ЗЛ = NULL Тогда //не найден контрагент
				Протокол.ДобавитьСтроку("Не найден ЗЛ "+ВыборкаДетальныеЗаписи.СНИЛС);
			ИначеЕсли ВыборкаДетальныеЗаписи.ДоговорОПС = NULL Тогда //не найден договор
				ФИО = ВыборкаДетальныеЗаписи.Фамилия+" "+ВыборкаДетальныеЗаписи.Имя+" "+ВыборкаДетальныеЗаписи.Отчество;
				Протокол.ДобавитьСтроку("Не найден договор об ОПС №"+ВыборкаДетальныеЗаписи.НомерДоговора+" от "+ВыборкаДетальныеЗаписи.ДатаЗаключения+" с "+ФИО+", страховой номер ПФР "+ВыборкаДетальныеЗаписи.СНИЛС);
			Иначе //все в порядке 
				#Удаление 
				Если ВыборкаДетальныеЗаписи.Состояние = Перечисления.уп_СостоянияДоговоровОПС.Закрыт Тогда					
				#КонецУдаления
				#Вставка 
				//+ ХМНПФ 19.03.2018 КлименкоМИ // РазобратьТаблицу() // №1435
				Если ВыборкаДетальныеЗаписи.Состояние = Перечисления.уп_СостоянияДоговоровОПС.Закрыт 
					И Лев(ВыборкаДетальныеЗаписи.ДоговорОПС.Наименование,2) <> Строка(Число(Прав(Год(ТекущаяДата()),2))-1) тогда
					//- ХМНПФ 19.03.2018 КлименкоМИ // РазобратьТаблицу() // №1435						
				#КонецВставки
					Протокол.ДобавитьСтроку("Договор №"+ВыборкаДетальныеЗаписи.ДоговорОПС.Код+" с "+ВыборкаДетальныеЗаписи.ДоговорОПС.Участник.Наименование+", страховой номер ПФР "+ВыборкаДетальныеЗаписи.СНИЛС+" уже закрыт и не будет внесен в табличную часть!");
					Продолжить;
				КонецЕсли;	
				Если ВыборкаДетальныеЗаписи.Состояние<>Перечисления.уп_СостоянияДоговоровОПС.ОжиданиеПодтвержденияПФР
					#Вставка 
					//+ ХМНПФ 19.03.2018 КлименкоМИ // РазобратьТаблицу() // №1435
					И Лев(ВыборкаДетальныеЗаписи.ДоговорОПС.Наименование,2) <> Строка(Число(Прав(Год(ТекущаяДата()),2))-1)
					//- ХМНПФ 19.03.2018 КлименкоМИ // РазобратьТаблицу() // №1435
					#КонецВставки
					и ВыборкаДетальныеЗаписи.Состояние<>Перечисления.уп_СостоянияДоговоровОПС.Заключен  Тогда
					Протокол.ДобавитьСтроку("Обратите внимание!! Состояние договора №"+ВыборкаДетальныеЗаписи.ДоговорОПС.Код+" с "+ВыборкаДетальныеЗаписи.ДоговорОПС.Участник.Наименование+", страховой номер ПФР "+ВыборкаДетальныеЗаписи.СНИЛС+" = "+ВыборкаДетальныеЗаписи.Состояние);
					Продолжить;
				КонецЕсли;	
				НовСтр = Объект.ДоговорыОПС.Добавить();
				НовСтр.ДоговорОПС = ВыборкаДетальныеЗаписи.ДоговорОПС;
				НовСтр.Участник = ВыборкаДетальныеЗаписи.ДоговорОПС.Участник;
				Если ВыборкаДетальныеЗаписи.Ошб1 = "V" Тогда
					НовСтр.Отказ1 = Истина;
				КонецЕсли;
				Если ВыборкаДетальныеЗаписи.Ошб2 = "V" Тогда
					НовСтр.Отказ2 = Истина;
				КонецЕсли;
				Если ВыборкаДетальныеЗаписи.Ошб3 = "V" Тогда
					НовСтр.Отказ3 = Истина;
				КонецЕсли;
				Если ВыборкаДетальныеЗаписи.Ошб4 = "V" Тогда
					НовСтр.Отказ4 = Истина;
				КонецЕсли;
				Если ВыборкаДетальныеЗаписи.Ошб5 = "V" Тогда
					НовСтр.Отказ5 = Истина;
				КонецЕсли;
				Если ВыборкаДетальныеЗаписи.Ошб6 = "V" Тогда
					НовСтр.Отказ6 = Истина;
				КонецЕсли;
				Если ВыборкаДетальныеЗаписи.Ошб7 = "V" Тогда
					НовСтр.Отказ7 = Истина;
				КонецЕсли;
				Если ВыборкаДетальныеЗаписи.Ошб8 = "V" Тогда
					НовСтр.Отказ8 = Истина;
				КонецЕсли;
				Если ВыборкаДетальныеЗаписи.Ошб9 = "V" Тогда
					НовСтр.Отказ9 = Истина;
				КонецЕсли;
				Если ВыборкаДетальныеЗаписи.Ошб10 = "V" Тогда
					НовСтр.Отказ10 = Истина;
				КонецЕсли;
				Если ВыборкаДетальныеЗаписи.Ошб11 = "V" Тогда
					НовСтр.Отказ11 = Истина;
				КонецЕсли;
				Если ВыборкаДетальныеЗаписи.Ошб12 = "V" Тогда
					НовСтр.Отказ12 = Истина;
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;
	Иначе //есть только СНИЛС
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТабДляЗагрузки.СНИЛС,
		|	ТабДляЗагрузки.НомерДоговора,
		|	ТабДляЗагрузки.ДатаЗаключения,
		|	ТабДляЗагрузки.Фамилия,
		|	ТабДляЗагрузки.Имя,
		|	ТабДляЗагрузки.Отчество,
		|	ТабДляЗагрузки.Ошб1,
		|	ТабДляЗагрузки.Ошб2,
		|	ТабДляЗагрузки.Ошб3,
		|	ТабДляЗагрузки.Ошб4,
		|	ТабДляЗагрузки.Ошб5,
		|	ТабДляЗагрузки.Ошб6,
		|	ТабДляЗагрузки.Ошб7,
		|	ТабДляЗагрузки.Ошб8,
		|	ТабДляЗагрузки.Ошб9,
		|	ТабДляЗагрузки.Ошб10,
		|	ТабДляЗагрузки.Ошб11,
		|	ТабДляЗагрузки.Ошб12,
		|	ТабДляЗагрузки.Нпп
		|ПОМЕСТИТЬ ИсходныеДанные
		|ИЗ
		|	&ТабДляЗагрузки КАК ТабДляЗагрузки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсходныеДанные.СНИЛС КАК СНИЛС,
		|	ИсходныеДанные.НомерДоговора,
		|	ИсходныеДанные.ДатаЗаключения,
		|	ИсходныеДанные.Фамилия,
		|	ИсходныеДанные.Имя,
		|	ИсходныеДанные.Отчество,
		|	ИсходныеДанные.Ошб1,
		|	ИсходныеДанные.Ошб2,
		|	ИсходныеДанные.Ошб3,
		|	ИсходныеДанные.Ошб4,
		|	ИсходныеДанные.Ошб5,
		|	ИсходныеДанные.Ошб6,
		|	ИсходныеДанные.Ошб7,
		|	ИсходныеДанные.Ошб8,
		|	ИсходныеДанные.Ошб9,
		|	ИсходныеДанные.Ошб10,
		|	ИсходныеДанные.Ошб11,
		|	ИсходныеДанные.Ошб12,
		|	уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС КАК ДоговорОПС,
		|	Контрагенты.Ссылка КАК ЗЛ,
		|	уп_СостоянияДоговораОПССрезПоследних.Состояние,
		|	ИсходныеДанные.Нпп КАК Нпп,
		|	уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС.Код КАК ДоговорНомер,
		|	уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС.ДатаЗаключения КАК ДоговорДата
		|ИЗ
		|	ИсходныеДанные КАК ИсходныеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_СостоянияДоговораОПС.СрезПоследних(&ДатаДок, ДоговорОПС.Организация = &Организация) КАК уп_СостоянияДоговораОПССрезПоследних
		|		ПО ИсходныеДанные.СНИЛС = уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|		ПО ИсходныеДанные.СНИЛС = Контрагенты.уп_ФизЛицо.СтраховойНомерПФР
		|
		|УПОРЯДОЧИТЬ ПО
		|	Нпп,
		|	ДоговорДата УБЫВ
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДоговорОПС)
		|ПО
		|	СНИЛС";

		Запрос.УстановитьПараметр("ДатаДок", Объект.Дата);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("ТабДляЗагрузки", ТЗ);

		Результат = Запрос.Выполнить();

		ВыборкаИтоги = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаИтоги.Следующий() Цикл
			ВыборкаДетальныеЗаписи = ВыборкаИтоги.Выбрать();
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				Если ВыборкаДетальныеЗаписи.ЗЛ = NULL Тогда //не найден контрагент
					Протокол.ДобавитьСтроку("Не найден ЗЛ "+ВыборкаДетальныеЗаписи.СНИЛС);
				ИначеЕсли ВыборкаДетальныеЗаписи.ДоговорОПС = NULL Тогда //не найден договор
					ФИО = ВыборкаДетальныеЗаписи.Фамилия+" "+ВыборкаДетальныеЗаписи.Имя+" "+ВыборкаДетальныеЗаписи.Отчество;
					Протокол.ДобавитьСтроку("Не найден договор об ОПС №"+ВыборкаДетальныеЗаписи.НомерДоговора+" от "+ВыборкаДетальныеЗаписи.ДатаЗаключения+" с "+ФИО+", страховой номер ПФР "+ВыборкаДетальныеЗаписи.СНИЛС);
				Иначе //все в порядке
					Если ВыборкаДетальныеЗаписи.Состояние = Перечисления.уп_СостоянияДоговоровОПС.Закрыт Тогда
						Протокол.ДобавитьСтроку("Договор №"+ВыборкаДетальныеЗаписи.ДоговорОПС.Код+" с "+ВыборкаДетальныеЗаписи.ДоговорОПС.Участник.Наименование+", страховой номер ПФР "+ВыборкаДетальныеЗаписи.СНИЛС+" уже закрыт и не будет внесен в табличную часть!");
						Продолжить;
					КонецЕсли;	
					Если ВыборкаДетальныеЗаписи.Состояние<>Перечисления.уп_СостоянияДоговоровОПС.ОжиданиеПодтвержденияПФР
						и ВыборкаДетальныеЗаписи.Состояние<>Перечисления.уп_СостоянияДоговоровОПС.Заключен  Тогда
						Протокол.ДобавитьСтроку("Обратите внимание!! Состояние договора №"+ВыборкаДетальныеЗаписи.ДоговорОПС.Код+" с "+ВыборкаДетальныеЗаписи.ДоговорОПС.Участник.Наименование+", страховой номер ПФР "+ВыборкаДетальныеЗаписи.СНИЛС+" = "+ВыборкаДетальныеЗаписи.Состояние);
						Продолжить;
					КонецЕсли;	
					НовСтр = Объект.ДоговорыОПС.Добавить();
					НовСтр.ДоговорОПС = ВыборкаДетальныеЗаписи.ДоговорОПС;
					НовСтр.Участник = ВыборкаДетальныеЗаписи.ДоговорОПС.Участник;
					Если ВыборкаДетальныеЗаписи.Ошб1 = "V" Тогда
						НовСтр.Отказ1 = Истина;
					КонецЕсли;
					Если ВыборкаДетальныеЗаписи.Ошб2 = "V" Тогда
						НовСтр.Отказ2 = Истина;
					КонецЕсли;
					Если ВыборкаДетальныеЗаписи.Ошб3 = "V" Тогда
						НовСтр.Отказ3 = Истина;
					КонецЕсли;
					Если ВыборкаДетальныеЗаписи.Ошб4 = "V" Тогда
						НовСтр.Отказ4 = Истина;
					КонецЕсли;
					Если ВыборкаДетальныеЗаписи.Ошб5 = "V" Тогда
						НовСтр.Отказ5 = Истина;
					КонецЕсли;
					Если ВыборкаДетальныеЗаписи.Ошб6 = "V" Тогда
						НовСтр.Отказ6 = Истина;
					КонецЕсли;
					Если ВыборкаДетальныеЗаписи.Ошб7 = "V" Тогда
						НовСтр.Отказ7 = Истина;
					КонецЕсли;
					Если ВыборкаДетальныеЗаписи.Ошб8 = "V" Тогда
						НовСтр.Отказ8 = Истина;
					КонецЕсли;
					Если ВыборкаДетальныеЗаписи.Ошб9 = "V" Тогда
						НовСтр.Отказ9 = Истина;
					КонецЕсли;
					Если ВыборкаДетальныеЗаписи.Ошб10 = "V" Тогда
						НовСтр.Отказ10 = Истина;
					КонецЕсли;
					Если ВыборкаДетальныеЗаписи.Ошб11 = "V" Тогда
						НовСтр.Отказ11 = Истина;
					КонецЕсли;
					Если ВыборкаДетальныеЗаписи.Ошб12 = "V" Тогда
						НовСтр.Отказ12 = Истина;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Протокол.ДобавитьСтроку("Не найден ЗЛ "+ВыборкаИтоги.СНИЛС);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	

КонецПроцедуры
